CREATE SCHEMA IF NOT EXISTS public_car;

CREATE TABLE IF NOT EXISTS public_car.cars
(
id UUID DEFAULT gen_random_uuid()  PRIMARY KEY,
name VARCHAR(10) NOT NULL,
description VARCHAR(30),
price NUMERIC NOT NULL,
created TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP
);

INSERT INTO public_car.cars (name, description, price, created)
VALUES ('Зубр', 'Хорошая машина!', 50000.0, '2023-11-14 14:00:00+03'),
('Волат', 'Большая машина!', 80000.0, '2023-11-13 12:00:00+03'),
('Лада', 'Бюджетная машина!', 10000.0, '2023-11-14 11:00:00+03'),
('Урал', 'Вездеходная машина!', 40000.0, '2000-07-05 12:00:00+03'),
('Ока', 'Маленькая машина!', 5000.0, '1985-01-12 12:00:00+03'),
('Заз', 'Прикольная машина!', 12000.0, '1800-10-13 12:00:00+03'),
('Маруся', 'Современная машина!', 180000.0, '2023-11-11 12:00:00+03'),
('УАЗ', 'Негодная машина!', 9000.0, '2015-07-08 12:00:00+03'),
('КРАЗ', 'Тяжёлая машина!', 90000.0, '2018-05-07 12:00:00+03'),
('Нива', 'Сельская машина!', 7000.0, '2019-10-20 12:00:00+03'),
('Автокам', 'Семейная машина!', 18000.0, '1975-03-23 12:00:00+03'),
('ГАЗ', 'Спецмашина!', 80000.0, '2022-09-07 12:00:00+03'),
('ЛУАЗ', 'Охотничья машина!', 18000.0, '2021-09-15 12:00:00+03'),
('ЗИЛ', 'Надёжная машина!', 60000.0, '1990-05-05 12:00:00+03'),
('ЗИС', 'Премиум машина!', 150000.0, '1965-06-08 12:00:00+03'),
('Камаз', 'Грузовая машина!', 90000.0, '2023-12-12 12:00:00+03'),
('Комбат', 'Спецджип!', 40000.0, '1995-09-26 12:00:00+03'),
('Москвич', 'Скоростная машина!', 60000.0, '1994-09-08 12:00:00+03'),
('ТаГАЗ', 'Легковая машина!', 14000.0, '2023-11-13 12:00:00+03'),
('ИЖ', 'Экспериментальная машина!', 75000.0, '1970-03-03 12:00:00+03'),
('СМЗ', 'Просто машина!', 11000.0, '2002-02-01 12:00:00+03'),
('Ё-Авто', 'Электрическая машина!', 44000.0, '2019-11-18 12:00:00+03'),
('Ворто', 'Машина для горных дорог!', 50000.0, '1980-04-11 12:00:00+03');